"""
斗地主的扑克牌游戏，相信许多人都会玩，本例要求编写一个斗地主的洗牌发牌程序，
要求按照斗地主的规则完成洗牌发牌的过程。一副扑克总共有54张牌，
牌面由花色和数字组成（包括J、Q、K、A字母）组成，花色有♠、♥、♦、♣ 四种，分别表示黑桃、红桃、方块、梅花，小☺、大☻分别表示小王和大王。
斗地主游戏共有三位玩家参与，首先将这54张牌的顺序打乱每人轮流摸一次牌，剩余3张留作底牌，然后在控制台打印三位玩家的牌和三张底牌
"""                  # 3位一人 17 *3 = 51  剩余 3张  洗牌需要引入random随机排序
import random
ls = []
while len(ls)< 54:
    num1 = random.randint(1,54)
    if num1 not in ls:
        ls.append(num1)
# ls_sort = sorted(ls)
# print(ls_sort)
print(ls)
#定义一个字典存储数字对应的牌
dic1 = { 1:"黑桃A",2:"红桃A",3:"方块A",4:"梅花A",
         5: "黑桃2", 6: "红桃2", 7: "方块2", 8: "梅花2",
         9: "黑桃3", 10: "红桃3", 11: "方块3", 12: "梅花3",
         13: "黑桃4", 14: "红桃4", 15: "方块4", 16: "梅花4",
         17: "黑桃5", 18: "红桃5", 19: "方块5", 20: "梅花5",
         21: "黑桃6", 22: "红桃6", 23: "方块6", 24: "梅花6",
         25: "黑桃7", 26: "红桃7", 27: "方块7", 28: "梅花7",
         29: "黑桃8", 30: "红桃8", 31: "方块8", 32: "梅花8",
         33: "黑桃9", 34: "红桃9", 35: "方块9", 36: "梅花9",
         37: "黑桃10", 38: "红桃10", 39: "方块10", 40: "梅花10",
         41: "黑桃J", 42: "红桃J", 43: "方块J", 44: "梅花J",
         45: "黑桃Q", 46: "红桃Q", 47: "方块Q", 48: "梅花Q",
         49: "黑桃K", 50: "红桃K", 51: "方块K", 52: "梅花K",
         53:"小 王 ",54:"大 王"
}
#定义一个变量存储第一个人的牌
#ls[0:49:3] 优化
peo1 = ls[0:51:3]
#定义转换后的牌
# peo1_change = []
print("第一个人的17张牌为:",end="\t")
for i in peo1:
    print(dic1[i], end='\t')
     # peo1_change.append(dic1[i])
# print("第一个人的牌为:",peo1_change)
#定义一个变量存储第二个人的牌
print("\n")
peo2 =ls[1:51:3]
#定义转换后的牌
# peo2_change = []
print("第二个人的17张牌为:",end="\t")
for i in peo2:
     # peo2_change.append(dic1[i])
     print(dic1[i], end='\t')
# print("第二个人的牌为:",peo1_change)
#定义一个变量存储第三人的牌
print("\n")
peo3 =ls [2:51:3]
#定义转换后的牌
# peo3_change = []
print("第三个人的17张牌为:",end="\t")
for i in peo3:
     # peo3_change.append(dic1[i])
     print(dic1[i], end='\t')
# print("第三个人的牌为:",peo1_change)
print("\n")
#剩余的牌
peo4 =ls[51:]
print("剩余三张牌为:",end="\t")
for i in peo4:
    print(dic1[i],end='\t')