"""
集合 支持的运算符 :

    1. 算术运算符 

        -  :   计算 两个集合的差集   

    2. 位运算符 

        & :  计算 2个集合的 交集

        | :  计算 2个集合的 并集

        ^ :  计算 2个集合的 补集 

    3. 关系运算符 

        > ,  >= ,  <,  <=,   == ,  !=

    4. 成员运算符 
        in  / not in 

"""
# 定义 2个集合 
s1 = {"xyz", "10", "abc", "123"}
s2 = {"10", "456"}

print(s2 - s1) 
print(s1 & s2) 
print(s1 | s2)  
print(s1 ^ s2)  

print(s1 > s2,  s1 >= s2,  s1 < s2,  s1 <= s2)

s3 = {"123", "456", "789"}
s4 = {"123", "789"}

print(s3 > s4, s3 >= s4, s3 != s4)