"""
【循环】一个正整数、它加上 100后是一个完全平方数、再加上 168 又是一个完全平方数、
请问满足该条件的第一个正数是多少？

1 ** 2=1
2 ** 2=4
3 ** 2=9
4 ** 2=16
5 ** 2=25
6 ** 2=36
7 ** 2=49
8 ** 2=64
9 ** 2=81
10 ** 2 = 100
11  **2 =  121
"""

"""
num = 1

while True:

    a = num + 100
    b = num + 168

    x = int(a ** 0.5)
    y = int(b ** 0.5)

    if x ** 2 == a and y ** 2 == b:
        break

    num += 1

print(num)

"""
n = 1
while True:
   a ,b  =  n + 100 ,1 + 268
   if a ** 0.5 % 1 == a and b ** 0.5 % 1 == b:
        break
   n += 1
print(n)